## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.keda-loadtesting is tainted, so must be replaced
-/+ resource "argocd_application" "keda-loadtesting" {
!       id      = "keda-loadtesting" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 12 -> (known after apply)
            name             = "keda-loadtesting"
!           resource_version = "4638297" -> (known after apply)
!           uid              = "54870a4f-5045-4e5c-8695-815f620957bc" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

!           source {
                # (4 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # argocd_project.loadtesting will be updated in-place
!   resource "argocd_project" "loadtesting" {
        id = "loadtesting"

!       spec {
            # (3 unchanged attributes hidden)

+           destination {
+               namespace = "kube-system"
+               server    = "https://82282b3b-3063-4462-92c5-160718170247.k8s.ondigitalocean.com"
            }
-           destination {
-               namespace = "loadtesting" -> null
-               server    = "https://82282b3b-3063-4462-92c5-160718170247.k8s.ondigitalocean.com" -> null
            }
+           destination {
+               namespace = "loadtesting"
+               server    = "https://82282b3b-3063-4462-92c5-160718170247.k8s.ondigitalocean.com"
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-2svww" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
